FILE_KEYWORDS = {
    "未交订单": "赛卓-未交订单",
    "成品在制": "赛卓-成品在制",
    "成品库存": "赛卓-成品库存",
    "CP在制": "赛卓-CP在制",
    "晶圆库存": "赛卓-晶圆库存",
    "到货明细": "赛卓-到货明细",
    "下单明细": "赛卓-下单明细",
    "销货明细": "赛卓-销货明细"
}

RENAME_MAP = {
                "成品在制": "赛卓-成品在制.xlsx",
                "CP在制": "赛卓-CP在制.xlsx",
                "成品库存": "赛卓-成品库存.xlsx",
                "晶圆库存": "赛卓-晶圆库存.xlsx",
                "未交订单": "赛卓-未交订单.xlsx"
            }

FIELD_MAPPINGS = {
    "赛卓-新旧料号": {
        "规格": "新规格",
        "品名": "新品名",
        "晶圆品名": "新晶圆品名",
        "供应商": "封装厂",
        "半成品": "半成品",
        "PC": "PC"
    },
    "赛卓-预测": {
        "规格": "产品型号",
        "品名": "生产料号"
    },
    "赛卓-供应商-PC": {
        "供应商": "封装厂",
        "PC": "PC"
    },
    "赛卓-安全库存": {
        "规格": "OrderInformation",
        "品名": "ProductionNO.",
        "晶圆品名": "WaferID"
    },
    "赛卓-成品在制": {
        "规格": "产品规格",
        "品名": "产品品名",
        "晶圆品名": "晶圆型号",
        "封装形式": "封装形式",
        "供应商": "工作中心",
        "PC": "PC"
    },
    "赛卓-到货明细": {
        "规格": "规格",
        "品名": "品名"
    },
    "赛卓-成品库存": {
        "规格": "规格",
        "品名": "品名",
        "晶圆品名": "WAFER品名"
    },
    "赛卓-未交订单": {
        "规格": "规格",
        "品名": "品名",
        "晶圆品名": "晶圆品名"
    },
    "赛卓-下单明细": {
        "规格": "回货明细_回货规格",
        "品名": "回货明细_回货品名",
        "供应商": "供应商名称",
        "PC": "生管人员"
    },
    "赛卓-销货明细": {
        "规格": "规格",
        "品名": "品名"
    }, 
    "赛卓-CP在制": {
        "规格": "产品规格",
        "品名": "产品品名",
        "晶圆品名": "晶圆型号",
        "供应商": "工作中心",
        "PC": "生管人员"
    },
    "赛卓-晶圆库存": {
        "规格": "规格",
        "品名": "品名",
        "晶圆品名": "WAFER品名"
    }
}

pivot_config = {
    "赛卓-未交订单.xlsx": {
        "index": ["规格", "晶圆品名", "品名"],
        "columns": "预交货日",
        "values": ["订单数量", "未交订单数量"],
        "aggfunc": "sum",
        "date_format": "%Y-%m"
    },
    "赛卓-成品在制.xlsx": {
        "index": ["工作中心", "封装形式", "晶圆型号", "产品规格", "产品品名"],
        "columns": "预计完工日期",
        "values": ["未交"],
        "aggfunc": "sum",
        "date_format": "%Y-%m"
    },
    "赛卓-CP在制.xlsx": {
        "index": ["晶圆型号", "产品品名"],
        "columns": "预计完工日期",
        "values": ["未交"],
        "aggfunc": "sum",
        "date_format": "%Y-%m"
    },
    "赛卓-成品库存.xlsx": {
        "index": ["WAFER品名", "规格", "品名"],
        "columns": "仓库名称",
        "values": ["数量"],
        "aggfunc": "sum"
    },
    "赛卓-晶圆库存.xlsx": {
        "index": ["WAFER品名", "规格"],
        "columns": "仓库名称",
        "values": ["数量"],
        "aggfunc": "sum"
    }
}

