# 用于识别上传文件类型

FILE_KEYWORDS = {
    "成品在制": "赛卓-成品在制",
    "到货明细": "赛卓-到货明细",
    "成品库存": "赛卓-成品库存",
    "未交订单": "赛卓-未交订单",
    "下单明细": "赛卓-下单明细",
    "销货明细": "赛卓-销货明细"
}



# 输出文件基础名称
OUTPUT_FILENAME_PREFIX = "运营主计划"

# 匹配
FIELD_MAPPINGS = {
    "赛卓-预测": {
        "规格": "产品型号",
        "品名": "生产料号"
    },
    "赛卓-供应商-PC": {
        "供应商": "封装厂",
        "PC": "PC"
    },
    "赛卓-安全库存": {
        "规格": "OrderInformation",
        "品名": "ProductionNO.",
        "晶圆品名": "WaferID"
    },
    "赛卓-成品在制": {
        "规格": "产品规格",
        "品名": "产品品名",
        "晶圆品名": "晶圆型号",
        "封装形式": "封装形式",
        "供应商": "工作中心",
        "PC": "PC"
    },
    "赛卓-到货明细": {
        "规格": "规格",
        "品名": "品名"
    },
    "赛卓-成品库存": {
        "规格": "规格",
        "品名": "品名",
        "晶圆品名": "WAFER品名"
    },
    "赛卓-未交订单": {
        "规格": "规格",
        "品名": "品名",
        "晶圆品名": "晶圆品名"
    },
    "赛卓-下单明细": {
        "规格": "回货明细_回货规格",
        "品名": "回货明细_回货品名",
        "供应商": "供应商名称",
        "PC": "生管人员"
    },
    "赛卓-销货明细": {
        "规格": "规格",
        "品名": "品名"
    }
}
